app/controllers/students_controller.rb

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
  def show
  	@student = Student.find(params[:id])

INSERT INTO `students` (`name`, `blood_group`, `department`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES ('mani', 'o+', 'computer', 'vertical_cylinder_cone_bottom_round_top.png', 'image/png', 1515, '2016-06-14 10:56:13', '2016-06-14 10:56:13', '2016-06-14 10:56:13')
---
  def create
  	puts params.inspect
    @student = Student.new(student_params)
    respond_to do |format|
      if @student.save

DELETE FROM `students` WHERE `students`.`id` = 1
---
def destroy
    @student.destroy

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
   def set_student
      @student = Student.find(params[:id])